
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |       61 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                               |
|:--------:|:--------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.aws_autoscaling_group.actions-runner`                                            |
|    🟢    | `module.actions-runner.aws_autoscaling_lifecycle_hook.terminating`                                      |
|    🟢    | `module.actions-runner.aws_iam_policy.required`                                                         |
|    🟢    | `module.actions-runner.aws_key_pair.actions-runner`                                                     |
|    🟢    | `module.actions-runner.aws_launch_template.actions-runner`                                              |
|    🟢    | `module.actions-runner.aws_security_group.actions-runner`                                               |
|    🟢    | `module.actions-runner.aws_vpc_security_group_egress_rule.default`                                      |
|    🟢    | `module.actions-runner.aws_vpc_security_group_ingress_rule.icmp`                                        |
|    🟢    | `module.actions-runner.aws_vpc_security_group_ingress_rule.ssh`                                         |
|    🟢    | `module.actions-runner.random_string.asg_name`                                                          |
|    🟢    | `module.actions-runner.random_string.profile-suffix`                                                    |
|    🟢    | `module.actions-runner.random_string.reg_token_suffix`                                                  |
|    🟢    | `module.actions-runner.tls_private_key.actions-runner`                                                  |
|    🟢    | `module.management.aws_default_route_table.default`                                                     |
|    🟢    | `module.management.aws_default_security_group.default`                                                  |
|    🟢    | `module.management.aws_eip.nat_eip["10.0.0.0/24"]`                                                      |
|    🟢    | `module.management.aws_eip.nat_eip["10.0.2.0/24"]`                                                      |
|    🟢    | `module.management.aws_internet_gateway.ig`                                                             |
|    🟢    | `module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]`                                               |
|    🟢    | `module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]`                                               |
|    🟢    | `module.management.aws_route.default_main`                                                              |
|    🟢    | `module.management.aws_route.subnet_private["10.0.1.0/24"]`                                             |
|    🟢    | `module.management.aws_route.subnet_private["10.0.3.0/24"]`                                             |
|    🟢    | `module.management.aws_route.subnet_public["10.0.0.0/24"]`                                              |
|    🟢    | `module.management.aws_route.subnet_public["10.0.2.0/24"]`                                              |
|    🟢    | `module.management.aws_route_table.all["10.0.0.0/24"]`                                                  |
|    🟢    | `module.management.aws_route_table.all["10.0.1.0/24"]`                                                  |
|    🟢    | `module.management.aws_route_table.all["10.0.2.0/24"]`                                                  |
|    🟢    | `module.management.aws_route_table.all["10.0.3.0/24"]`                                                  |
|    🟢    | `module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]`                         |
|    🟢    | `module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]`                         |
|    🟢    | `module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]`                         |
|    🟢    | `module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]`                         |
|    🟢    | `module.management.aws_subnet.all["10.0.0.0/24"]`                                                       |
|    🟢    | `module.management.aws_subnet.all["10.0.1.0/24"]`                                                       |
|    🟢    | `module.management.aws_subnet.all["10.0.2.0/24"]`                                                       |
|    🟢    | `module.management.aws_subnet.all["10.0.3.0/24"]`                                                       |
|    🟢    | `module.management.aws_vpc.vpc`                                                                         |
|    🟢    | `module.management.aws_vpc_security_group_egress_rule.default[0]`                                       |
|    🟢    | `module.management.aws_vpc_security_group_ingress_rule.default[0]`                                      |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_instance_profile.profile`                        |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_policy.profile`                                  |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_role.profile`                                    |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_role_policy_attachment.profile`                  |
|    🟢    | `module.actions-runner.module.registration.aws_cloudwatch_event_rule.scale`                             |
|    🟢    | `module.actions-runner.module.registration.aws_cloudwatch_event_target.scale-in-out`                    |
|    🟢    | `module.actions-runner.module.registration.aws_cloudwatch_log_group.lambda`                             |
|    🟢    | `module.actions-runner.module.registration.aws_iam_policy.lambda_logging`                               |
|    🟢    | `module.actions-runner.module.registration.aws_iam_policy.lambda_permissions`                           |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role.lambda`                                         |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`  |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_logs`                  |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_permissions`           |
|    🟢    | `module.actions-runner.module.registration.aws_lambda_function.main`                                    |
|    🟢    | `module.actions-runner.module.registration.aws_lambda_function_event_invoke_config.runner_registration` |
|    🟢    | `module.actions-runner.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook`   |
|    🟢    | `module.actions-runner.module.registration.aws_s3_bucket.lambda_tmp`                                    |
|    🟢    | `module.actions-runner.module.registration.aws_s3_bucket_public_access_block.public_access`             |
|    🟢    | `module.actions-runner.module.registration.aws_s3_object.lambda_package`                                |
|    🟢    | `module.actions-runner.module.registration.null_resource.install_python_dependencies`                   |
|    🟢    | `module.actions-runner.module.registration.random_uuid.lamda_src_hash`                                  |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.data.aws_iam_policy_document.required_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:SetInstanceHealth",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner.data.aws_subnet.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet" "selected" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_lni_at_device_index                     = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.actions-runner.data.aws_vpc.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "selected" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + cidr_block_associations              = (known after apply)
      + default                              = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = (known after apply)
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + state                                = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.actions-runner.aws_autoscaling_group.actions-runner will be created
  + resource "aws_autoscaling_group" "actions-runner" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 900
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 432000
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + initial_lifecycle_hook {
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "launching"
            # (3 unchanged attributes hidden)
        }

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }
      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "303467602807"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-303467602807"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/actions-runner/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "development"
        }
      + tag {
          + key                 = "lambda_name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }

      + traffic_source (known after apply)
    }

  # module.actions-runner.aws_autoscaling_lifecycle_hook.terminating will be created
  + resource "aws_autoscaling_lifecycle_hook" "terminating" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "terminating"
    }

  # module.actions-runner.aws_iam_policy.required will be created
  + resource "aws_iam_policy" "required" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.actions-runner.aws_key_pair.actions-runner will be created
  + resource "aws_key_pair" "actions-runner" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "actions-runner-generated-"
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all        = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.aws_launch_template.actions-runner will be created
  + resource "aws_launch_template" "actions-runner" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-084c9d40e7979390b"
      + instance_type          = "t3a.small"
      + key_name               = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner-"
      + tags                   = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 64
              + volume_type           = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
    }

  # module.actions-runner.aws_security_group.actions-runner will be created
  + resource "aws_security_group" "actions-runner" {
      + arn                    = (known after apply)
      + description            = "Manage traffic to GitHub Actions runner"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "actions-runner"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "actions-runner"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + vpc_id                 = (known after apply)
    }

  # module.actions-runner.aws_vpc_security_group_egress_rule.default will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "outgoing traffic"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "outgoing traffic"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + to_port                = -1
    }

  # module.actions-runner.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = (known after apply)
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "SSH access"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "SSH access"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + to_port                = 22
    }

  # module.actions-runner.random_string.asg_name will be created
  + resource "random_string" "asg_name" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner.random_string.profile-suffix will be created
  + resource "random_string" "profile-suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner.random_string.reg_token_suffix will be created
  + resource "random_string" "reg_token_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner.tls_private_key.actions-runner will be created
  + resource "tls_private_key" "actions-runner" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.management.aws_default_route_table.default will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"        = "Main table for 10.0.0.0/22"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/22"
          + "service"     = "management"
        }
      + tags_all               = {
          + "Name"        = "Main table for 10.0.0.0/22"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/22"
          + "service"     = "management"
        }
      + vpc_id                 = (known after apply)
    }

  # module.management.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "10.0.0.0/22 default"
          + "environment" = "development"
          + "service"     = "management"
        }
      + tags_all               = {
          + "Name"        = "10.0.0.0/22 default"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "service"     = "management"
        }
      + vpc_id                 = (known after apply)
    }

  # module.management.aws_eip.nat_eip["10.0.0.0/24"] will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + tags_all             = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + vpc                  = (known after apply)
    }

  # module.management.aws_eip.nat_eip["10.0.2.0/24"] will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "environment" = "development"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + tags_all             = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + vpc                  = (known after apply)
    }

  # module.management.aws_internet_gateway.ig will be created
  + resource "aws_internet_gateway" "ig" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "Internet gateway"
          + "environment" = "development"
          + "service"     = "management"
        }
      + tags_all = {
          + "Name"        = "Internet gateway"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "service"     = "management"
        }
      + vpc_id   = (known after apply)
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "NAT gateway"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + tags_all                           = {
          + "Name"        = "NAT gateway"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "NAT gateway"
          + "environment" = "development"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + tags_all                           = {
          + "Name"        = "NAT gateway"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
    }

  # module.management.aws_route.default_main will be created
  + resource "aws_route" "default_main" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_private["10.0.1.0/24"] will be created
  + resource "aws_route" "subnet_private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_private["10.0.3.0/24"] will be created
  + resource "aws_route" "subnet_private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_public["10.0.0.0/24"] will be created
  + resource "aws_route" "subnet_public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_public["10.0.2.0/24"] will be created
  + resource "aws_route" "subnet_public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.0.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.0.0/24"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.0.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.1.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.1.0/24"
          + "environment" = "development"
          + "residency"   = "10.0.1.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.1.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.1.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.2.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.2.0/24"
          + "environment" = "development"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.2.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.3.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.3.0/24"
          + "environment" = "development"
          + "residency"   = "10.0.3.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.3.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "residency"   = "10.0.3.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.0.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "management: public 10.0.0.0/24"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "management: public 10.0.0.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.1.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "management: private 10.0.1.0/24"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "management: private 10.0.1.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.2.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "management: public 10.0.2.0/24"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "management: public 10.0.2.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.3.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "management: private 10.0.3.0/24"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "management: private 10.0.3.0/24"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/22"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "VPC for management (development) 10.0.0.0/22"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                             = {
          + "Name"        = "VPC for management (development) 10.0.0.0/22"
          + "created_by"  = "infrahouse/aws-control-303467602807"
          + "environment" = "development"
          + "management"  = "true"
          + "service"     = "management"
        }
    }

  # module.management.aws_vpc_security_group_egress_rule.default[0] will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"       = "outgoing traffic"
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.management.aws_vpc_security_group_ingress_rule.default[0] will be created
  + resource "aws_vpc_security_group_ingress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "incoming traffic"
        }
      + tags_all               = {
          + "Name"       = "incoming traffic"
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.actions-runner.module.instance-profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "actions-runner"
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id   = (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
    }

  # module.actions-runner.module.instance-profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "actions-runner"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "actions-runner"
    }

  # module.actions-runner.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.registration.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "autoscaling:RecordLifecycleActionHeartbeat",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:DescribeTags",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:303467602807:instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:PutSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner.module.registration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.registration.aws_cloudwatch_event_rule.scale will be created
  + resource "aws_cloudwatch_event_rule" "scale" {
      + arn            = (known after apply)
      + description    = "ASG lifecycle hook"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "asg-scale"
      + tags           = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all       = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.registration.aws_cloudwatch_event_target.scale-in-out will be created
  + resource "aws_cloudwatch_event_target" "scale-in-out" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.actions-runner.module.registration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.registration.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.registration.aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.registration.aws_lambda_function_event_invoke_config.runner_registration will be created
  + resource "aws_lambda_function_event_invoke_config" "runner_registration" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.registration.aws_s3_bucket.lambda_tmp will be created
  + resource "aws_s3_bucket" "lambda_tmp" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-asg-lambda-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                    = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.actions-runner.module.registration.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.actions-runner.module.registration.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner.module.registration.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "f6ebc7184e6f8938271d2507843314f4"
          + "main_version"         = "7ab525ee464d3386128b53849508d538"
        }
    }

  # module.actions-runner.module.registration.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "7ab525ee464d3386128b53849508d538"
          + "requirements.txt" = "f6ebc7184e6f8938271d2507843314f4"
        }
      + result  = (known after apply)
    }

  # module.actions-runner.module.userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

Plan: 61 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDYxLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=
```
</details>